idea-ptm-metalearning-fine-tuning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-15 Mon 19:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>idea:预训练模型在小样本学习下的可解释性</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liangzid" />
</head>
<body>
<div id="content">
<h1 class="title">idea:预训练模型在小样本学习下的可解释性</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc4fa470">相关工作的介绍</a></li>
<li><a href="#orgf34bdf9">本论文的思路</a></li>
</ul>
</div>
</div>
<p>
Why fine-tuning and prompt works? A meta-learning view.
</p>

<div id="outline-container-orgc4fa470" class="outline-2">
<h2 id="orgc4fa470">相关工作的介绍</h2>
<div class="outline-text-2" id="text-orgc4fa470">
<p>
传统机器学习与元学习的区别：传统机器学习以样本为训练集、测试集的基本单位，而元学习以task为基本单位；
传统机器学习旨在学习一个较好的表示学习器或分类器，而元学习旨在学习一个较好的、在小样本下可以简单快速生成表示学习器的神经网络。
</p>

<p>
元学习包括三种思路：
</p>
<ol class="org-ol">
<li>更好的模型初始化参数；</li>
<li>更好的模型结构；</li>
<li>更好的优化器</li>
</ol>
</div>
</div>

<div id="outline-container-orgf34bdf9" class="outline-2">
<h2 id="orgf34bdf9">本论文的思路</h2>
<div class="outline-text-2" id="text-orgf34bdf9">
<p>
Q：fine-tuning的思路意味着什么？
</p>

<p>
A1：预训练任务可以让预训练模型学到一个不错的超平面，在这个超平面上，不同的NLP的task都具有明显的区分，同时预训练之后的结果使得最终的模型初始参数恰恰落在这个超平面上；
</p>

<p>
A2：连接预训练模型的分类器，本质上相当于是在上述超平面上的一个点，如果该点距离各个task的平均距离比较近，则他们可以获得更好的效果；
</p>

<p>
Q：基于prompt的方法
</p>

<p>
基于prompt的方法主要包括两类，一种是设计输入pattern的方法，主要用在NLU上；还有一种是加prefix的方法，主要用在NLG模型上。
针对于这两种方法，可以看出：设计输入pattern的方法，其核心想法是在不改变超平面位置的前提下，拉近各个task与超平面中模型的距离；（这个任务与传统的meta-learning是相对的，不过相同的是二者的距离都被缩小了）；
而基于prefix的方法，其所起到的作用跟基于pattern的方法是一致的。但不同的是，基于pattern的方法提供的是一种离散的空间分布（因为输入只能是一些有意义的token），而prefix的方法则是使用一种连续的token输入，因而移动起来更容易一些，也更简单。
</p>

<p>
Q：对比学习的预训练任务意味着什么？
</p>

<p>
不同于MLM这种生成式任务，对比学习的预训练任务是基于相似性的，因此，基于对比学习的方法，更像是一种基于比较而进行meta-learning的方式。这种meta-learning的方式，可能更多的是想把一个task内部的诸多类别给区分开？？？</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fri Sep 10 11:32:30 2021</p>
<p class="author">Author: liangzid</p>
<p class="date">Created: 2021-11-15 Mon 19:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
